// Задача 1.
// Напишите программу, которая на вход принимает число и выдает его квадрат(число, умноженное само на себя)

Console.WriteLine("Hello, World!");
